# Ejercicios Intro Pandas

![imagen](../img/ejercicios.png)

## Ejercicio 1
Importa el módulo `pandas` y el módulo `numpy`.

In [1]:
import numpy as np
import pandas as pd

## Ejercicio 2

Define una lista de 10 elementos y crea con ella un objeto `pandas.Series`.

In [2]:
lst = [x**2-4 for x in range(10)]

In [3]:
serie = pd.Series(lst)

serie

0    -4
1    -3
2     0
3     5
4    12
5    21
6    32
7    45
8    60
9    77
dtype: int64

## Ejercicio 3

Usa los índices para devolver el cuarto valor de la serie anterior.

*Recuerda que los índices en Python empiezan en 0.*

In [4]:
serie[3]

5

## Ejercicio 4

Define un `numpy.ndarray` de dimensiones (10, 5) y crea con él un `pandas.DataFrame`.

In [5]:
array = np.random.randint(0, 10, size = (10,5))

In [6]:
df = pd.DataFrame(array)

df

   0  1  2  3  4
0  2  7  4  4  3
1  6  4  9  5  4
2  3  2  8  5  8
3  4  5  8  1  4
4  1  7  2  3  5
5  7  8  3  3  5
6  8  5  4  8  9
7  4  9  9  3  5
8  5  3  1  9  1
9  4  1  9  7  4

## Ejercicio 5

Renombra las columnas con la siguiente lista:

In [7]:
columns = ['Rate_1', 'Rate_2', 'Rate_3', 'Rate_4', 'Rate_5']

In [8]:
df.columns = columns

df

   Rate_1  Rate_2  Rate_3  Rate_4  Rate_5
0       2       7       4       4       3
1       6       4       9       5       4
2       3       2       8       5       8
3       4       5       8       1       4
4       1       7       2       3       5
5       7       8       3       3       5
6       8       5       4       8       9
7       4       9       9       3       5
8       5       3       1       9       1
9       4       1       9       7       4

## Ejercicio 6

Crea un subconjunto del dataframe que contenga las columnas `Rate_1`, `Rate_3` y `Rate_5`.

In [9]:
df[['Rate_1', 'Rate_3', 'Rate_5']]

   Rate_1  Rate_3  Rate_5
0       2       4       3
1       6       9       4
2       3       8       8
3       4       8       4
4       1       2       5
5       7       3       5
6       8       4       9
7       4       9       5
8       5       1       1
9       4       9       4

## Ejercicio 7

Crea un subconjunto del dataframe que contenga las filas pares.

In [10]:
df.iloc[::2]

   Rate_1  Rate_2  Rate_3  Rate_4  Rate_5
0       2       7       4       4       3
2       3       2       8       5       8
4       1       7       2       3       5
6       8       5       4       8       9
8       5       3       1       9       1

## Ejercicio 8

Calcula la media de la columna `Rate_4`.

In [11]:
df.Rate_4.mean()

4.8

## Ejercicio 8

Calcula la mediana de la columna `Rate_1`.

In [12]:
df.Rate_1.median()

4.0

## Ejercicio 9

Calcula el mínimo de la columna `Rate_2`.

In [13]:
df.Rate_2.min()

1

## Ejercicio 10

Calcula el máximo de la columna `Rate_5`.

In [14]:
df.Rate_5.max()

9

## Ejercicio 11

Crea un `pandas.DataFrame` con el siguiente diccionario:

In [15]:
products = {'Desc': ['Lunch bag', 'Vintage leaf cake cases', 'Ribbon reel stripes','Gliders', 'Playing cards',
                     'Popcorn holder', 'Alphabet blocks', 'Party bunting', 'Color Pen', 'Paint book'],
           'Quantity': [1, 24, 1, 2880, 2, 7, 1, 4, 10, 48],
           'UnitPrice': [1.65, 0.55, 1.65, 0.18, 1.25, 0.85, 11.95, 4.95, 0.19, 1.25],
           'Revenue': [1.65, 13.2, 1.65, 518.4, 2.5, 5.95, 11.95, 19.8, 1.9, 60.0]}

In [16]:
df_dic = pd.DataFrame(products)

df_dic

                      Desc  Quantity  UnitPrice  Revenue
0                Lunch bag         1       1.65     1.65
1  Vintage leaf cake cases        24       0.55    13.20
2      Ribbon reel stripes         1       1.65     1.65
3                  Gliders      2880       0.18   518.40
4            Playing cards         2       1.25     2.50
5           Popcorn holder         7       0.85     5.95
6          Alphabet blocks         1      11.95    11.95
7            Party bunting         4       4.95    19.80
8                Color Pen        10       0.19     1.90
9               Paint book        48       1.25    60.00

## Ejercicio 12

Calcula la cantidad (`Quantity`) y beneficio (`Revenue`) totales.

In [17]:
# cantidad total

df_dic.Quantity.sum()

2978

In [18]:
# beneficio total

df_dic.Revenue.sum()

637.0

## Ejercicio 13

¿Cuál es el producto más caro?. ¿El más barato?. ¿Y el más vendido?

In [19]:
# barato

df_dic[df_dic.UnitPrice==df_dic.UnitPrice.min()]

      Desc  Quantity  UnitPrice  Revenue
3  Gliders      2880       0.18    518.4

In [20]:
# caro

df_dic[df_dic.UnitPrice==df_dic.UnitPrice.max()]

              Desc  Quantity  UnitPrice  Revenue
6  Alphabet blocks         1      11.95    11.95

In [21]:
# más vendido

df_dic[df_dic.Quantity==df_dic.Quantity.max()]

      Desc  Quantity  UnitPrice  Revenue
3  Gliders      2880       0.18    518.4